app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @book = Book.new
    @books = Book.all

INSERT INTO "books" ("user_id", "created_at", "updated_at", "title", "body") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["created_at", "2021-10-23 08:15:52.004544"], ["updated_at", "2021-10-23 08:15:52.004544"], ["title", "aaa"], ["body", "aaa"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      flash[:success] = "You have created book successfully."
      redirect_to book_path(@book.id)

    else
      @books = Book.all