app/controllers/users_controller.rb

  def index
    @user = current_user

    @users = User.all
---
SELECT "users".* FROM "users"

  def update
    @user = User.find(params[:id])

    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", nil], ["introduction", "aaa"], ["updated_at", "2021-10-26 07:27:12.216405"], ["id", 2]]

  def correct_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]